Masmiseim36/nxpSDK/boards/frdmkl81z/project_template/pin_mux.h
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTA18 (number 40), Y2[3]/EXTAL
  @{ */
#define BOARD_EXTAL12M_PERIPHERAL OSC      /*!<@brief Device name: OSC */
#define BOARD_EXTAL12M_SIGNAL EXTAL0       /*!<@brief OSC signal: EXTAL0 */
#define BOARD_EXTAL12M_PORT PORTA          /*!<@brief PORT device name: PORTA */
#define BOARD_EXTAL12M_PIN 18U             /*!<@brief PORTA pin index: 18 */
#define BOARD_EXTAL12M_PIN_NAME EXTAL0     /*!<@brief Pin name */
#define BOARD_EXTAL12M_LABEL "Y2[3]/EXTAL" /*!<@brief Label */
#define BOARD_EXTAL12M_NAME "EXTAL12M"     /*!<@brief Identifier name */
                                           /* @} */

/*! @name PORTA19 (number 41), Y2[1]/XTAL
  @{ */
#define BOARD_XTAL12M_PERIPHERAL OSC     /*!<@brief Device name: OSC */
#define BOARD_XTAL12M_SIGNAL XTAL0       /*!<@brief OSC signal: XTAL0 */
#define BOARD_XTAL12M_PORT PORTA         /*!<@brief PORT device name: PORTA */
#define BOARD_XTAL12M_PIN 19U            /*!<@brief PORTA pin index: 19 */
#define BOARD_XTAL12M_PIN_NAME XTAL0     /*!<@brief Pin name */
#define BOARD_XTAL12M_LABEL "Y2[1]/XTAL" /*!<@brief Label */
#define BOARD_XTAL12M_NAME "XTAL12M"     /*!<@brief Identifier name */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCPins(void);

/*! @name EXTAL32 (number 27), Y1[1]/EXTAL32_RTC
  @{ */
#define BOARD_EXTAL32_RTC_PERIPHERAL RTC            /*!<@brief Device name: RTC */
#define BOARD_EXTAL32_RTC_SIGNAL EXTAL32            /*!<@brief RTC signal: EXTAL32 */
#define BOARD_EXTAL32_RTC_PIN_NAME EXTAL32          /*!<@brief Pin name */
#define BOARD_EXTAL32_RTC_LABEL "Y1[1]/EXTAL32_RTC" /*!<@brief Label */
#define BOARD_EXTAL32_RTC_NAME "EXTAL32_RTC"        /*!<@brief Identifier name */
                                                    /* @} */

/*! @name XTAL32 (number 26), Y1[2]/XTAL32_RTC
  @{ */
#define BOARD_XTAL32_RTC_PERIPHERAL RTC           /*!<@brief Device name: RTC */
#define BOARD_XTAL32_RTC_SIGNAL XTAL32            /*!<@brief RTC signal: XTAL32 */
#define BOARD_XTAL32_RTC_PIN_NAME XTAL32          /*!<@brief Pin name */
#define BOARD_XTAL32_RTC_LABEL "Y1[2]/XTAL32_RTC" /*!<@brief Label */
#define BOARD_XTAL32_RTC_NAME "XTAL32_RTC"        /*!<@brief Identifier name */
                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitRTCPins(void);

#define SOPT5_LPUART0RXSRC_LPUART_RX 0x00u /*!<@brief LPUART 0 receive data source select: LPUART0_RX pin */
#define SOPT5_LPUART0TXSRC_LPUART_TX 0x00u /*!<@brief LPUART0 transmit data source select: LPUART0_TX pin */

/*! @name PORTB16 (number 51), J1[2]/Arduino_D0_UART0_RX/UART1_RX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_RX_PERIPHERAL LPUART0                                /*!<@brief Device name: LPUART0 */
#define BOARD_DEBUG_UART_RX_SIGNAL RX                                         /*!<@brief LPUART0 signal: RX */
#define BOARD_DEBUG_UART_RX_PORT PORTB                                        /*!<@brief PORT device name: PORTB */
#define BOARD_DEBUG_UART_RX_PIN 16U                                           /*!<@brief PORTB pin index: 16 */
#define BOARD_DEBUG_UART_RX_PIN_NAME LPUART0_RX                               /*!<@brief Pin name */
#define BOARD_DEBUG_UART_RX_LABEL "J1[2]/Arduino_D0_UART0_RX/UART1_RX_TGTMCU" /*!<@brief Label */
#define BOARD_DEBUG_UART_RX_NAME "DEBUG_UART_RX"                              /*!<@brief Identifier name */
                                                                              /* @} */

/*! @name PORTB17 (number 52), J1[4]/Arduino_D1_UART0_TX/UART1_TX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_TX_PERIPHERAL LPUART0                                /*!<@brief Device name: LPUART0 */
#define BOARD_DEBUG_UART_TX_SIGNAL TX                                         /*!<@brief LPUART0 signal: TX */
#define BOARD_DEBUG_UART_TX_PORT PORTB                                        /*!<@brief PORT device name: PORTB */
#define BOARD_DEBUG_UART_TX_PIN 17U                                           /*!<@brief PORTB pin index: 17 */
#define BOARD_DEBUG_UART_TX_PIN_NAME LPUART0_TX                               /*!<@brief Pin name */
#define BOARD_DEBUG_UART_TX_LABEL "J1[4]/Arduino_D1_UART0_TX/UART1_TX_TGTMCU" /*!<@brief Label */
#define BOARD_DEBUG_UART_TX_NAME "DEBUG_UART_TX"                              /*!<@brief Identifier name */
#define BOARD_DEBUG_UART_TX_DIRECTION kPIN_MUX_DirectionOutput                /*!<@brief Direction */
                                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name PORTD0 (number 73), SW3
  @{ */
#define BOARD_SW3_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_SW3_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_SW3_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_SW3_GPIO_PIN 0U                       /*!<@brief PORTD pin index: 0 */
#define BOARD_SW3_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_SW3_PIN 0U                            /*!<@brief PORTD pin index: 0 */
#define BOARD_SW3_CHANNEL 0                         /*!<@brief GPIOD GPIO channel: 0 */
#define BOARD_SW3_PIN_NAME PTD0                     /*!<@brief Pin name */
#define BOARD_SW3_LABEL "SW3"                       /*!<@brief Label */
#define BOARD_SW3_NAME "SW3"                        /*!<@brief Identifier name */
#define BOARD_SW3_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                    /* @} */

/*! @name PORTA4 (number 33), SW2
  @{ */
#define BOARD_SW2_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_SW2_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_SW2_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_SW2_GPIO_PIN 4U                       /*!<@brief PORTA pin index: 4 */
#define BOARD_SW2_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_SW2_PIN 4U                            /*!<@brief PORTA pin index: 4 */
#define BOARD_SW2_CHANNEL 4                         /*!<@brief GPIOA GPIO channel: 4 */
#define BOARD_SW2_PIN_NAME PTA4                     /*!<@brief Pin name */
#define BOARD_SW2_LABEL "SW2"                       /*!<@brief Label */
#define BOARD_SW2_NAME "SW2"                        /*!<@brief Identifier name */
#define BOARD_SW2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void);

/*! @name PORTC0 (number 55), J4[6]/ADC0_SE14/Arduino_A2_ADC0_SE14/LEDRGB_BLUE
  @{ */
#define BOARD_LED_BLUE_PERIPHERAL GPIOC                                         /*!<@brief Device name: GPIOC */
#define BOARD_LED_BLUE_SIGNAL GPIO                                              /*!<@brief GPIOC signal: GPIO */
#define BOARD_LED_BLUE_GPIO GPIOC                                               /*!<@brief GPIO device name: GPIOC */
#define BOARD_LED_BLUE_GPIO_PIN 0U                                              /*!<@brief PORTC pin index: 0 */
#define BOARD_LED_BLUE_PORT PORTC                                               /*!<@brief PORT device name: PORTC */
#define BOARD_LED_BLUE_PIN 0U                                                   /*!<@brief PORTC pin index: 0 */
#define BOARD_LED_BLUE_CHANNEL 0                                                /*!<@brief GPIOC GPIO channel: 0 */
#define BOARD_LED_BLUE_PIN_NAME PTC0                                            /*!<@brief Pin name */
#define BOARD_LED_BLUE_LABEL "J4[6]/ADC0_SE14/Arduino_A2_ADC0_SE14/LEDRGB_BLUE" /*!<@brief Label */
#define BOARD_LED_BLUE_NAME "LED_BLUE"                                          /*!<@brief Identifier name */
#define BOARD_LED_BLUE_DIRECTION kPIN_MUX_DirectionOutput                       /*!<@brief Direction */
                                                                                /* @} */

/*! @name PORTC1 (number 56), J1[8]/Arduino_D3/Arduino_D3_LED1/LEDRGB_RED
  @{ */
#define BOARD_LED_RED_PERIPHERAL GPIOC                                    /*!<@brief Device name: GPIOC */
#define BOARD_LED_RED_SIGNAL GPIO                                         /*!<@brief GPIOC signal: GPIO */
#define BOARD_LED_RED_GPIO GPIOC                                          /*!<@brief GPIO device name: GPIOC */
#define BOARD_LED_RED_GPIO_PIN 1U                                         /*!<@brief PORTC pin index: 1 */
#define BOARD_LED_RED_PORT PORTC                                          /*!<@brief PORT device name: PORTC */
#define BOARD_LED_RED_PIN 1U                                              /*!<@brief PORTC pin index: 1 */
#define BOARD_LED_RED_CHANNEL 1                                           /*!<@brief GPIOC GPIO channel: 1 */
#define BOARD_LED_RED_PIN_NAME PTC1                                       /*!<@brief Pin name */
#define BOARD_LED_RED_LABEL "J1[8]/Arduino_D3/Arduino_D3_LED1/LEDRGB_RED" /*!<@brief Label */
#define BOARD_LED_RED_NAME "LED_RED"                                      /*!<@brief Identifier name */
#define BOARD_LED_RED_DIRECTION kPIN_MUX_DirectionOutput                  /*!<@brief Direction */
                                                                          /* @} */

/*! @name PORTC2 (number 57), J1[12]/Arduino_D5/Arduino_D5_LED2/LEDRGB_GREEN
  @{ */
#define BOARD_LED_GREEN_PERIPHERAL GPIOC                                       /*!<@brief Device name: GPIOC */
#define BOARD_LED_GREEN_SIGNAL GPIO                                            /*!<@brief GPIOC signal: GPIO */
#define BOARD_LED_GREEN_GPIO GPIOC                                             /*!<@brief GPIO device name: GPIOC */
#define BOARD_LED_GREEN_GPIO_PIN 2U                                            /*!<@brief PORTC pin index: 2 */
#define BOARD_LED_GREEN_PORT PORTC                                             /*!<@brief PORT device name: PORTC */
#define BOARD_LED_GREEN_PIN 2U                                                 /*!<@brief PORTC pin index: 2 */
#define BOARD_LED_GREEN_CHANNEL 2                                              /*!<@brief GPIOC GPIO channel: 2 */
#define BOARD_LED_GREEN_PIN_NAME PTC2                                          /*!<@brief Pin name */
#define BOARD_LED_GREEN_LABEL "J1[12]/Arduino_D5/Arduino_D5_LED2/LEDRGB_GREEN" /*!<@brief Label */
#define BOARD_LED_GREEN_NAME "LED_GREEN"                                       /*!<@brief Identifier name */
#define BOARD_LED_GREEN_DIRECTION kPIN_MUX_DirectionOutput                     /*!<@brief Direction */
                                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

/*! @name USB0_DP (number 14), J11[3]/USB_DP
  @{ */
#define BOARD_USB_DP_PERIPHERAL USB0       /*!<@brief Device name: USB0 */
#define BOARD_USB_DP_SIGNAL DP             /*!<@brief USB0 signal: DP */
#define BOARD_USB_DP_PIN_NAME USB0_DP      /*!<@brief Pin name */
#define BOARD_USB_DP_LABEL "J11[3]/USB_DP" /*!<@brief Label */
#define BOARD_USB_DP_NAME "USB_DP"         /*!<@brief Identifier name */
                                           /* @} */

/*! @name USB0_DM (number 15), J11[2]/USB_DN
  @{ */
#define BOARD_USB_DN_PERIPHERAL USB0       /*!<@brief Device name: USB0 */
#define BOARD_USB_DN_SIGNAL DM             /*!<@brief USB0 signal: DM */
#define BOARD_USB_DN_PIN_NAME USB0_DM      /*!<@brief Pin name */
#define BOARD_USB_DN_LABEL "J11[2]/USB_DN" /*!<@brief Label */
#define BOARD_USB_DN_NAME "USB_DN"         /*!<@brief Identifier name */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void);

/*! @name PORTB18 (number 53), E1[1]/TSI_CH11/FXIO_D6
  @{ */
#define BOARD_TSI_ELECTRODE_1_PERIPHERAL TSI0                /*!<@brief Device name: TSI0 */
#define BOARD_TSI_ELECTRODE_1_SIGNAL CH                      /*!<@brief TSI0 signal: CH */
#define BOARD_TSI_ELECTRODE_1_PORT PORTB                     /*!<@brief PORT device name: PORTB */
#define BOARD_TSI_ELECTRODE_1_PIN 18U                        /*!<@brief PORTB pin index: 18 */
#define BOARD_TSI_ELECTRODE_1_CHANNEL 11                     /*!<@brief TSI0 channel: 11 */
#define BOARD_TSI_ELECTRODE_1_PIN_NAME TSI0_CH11             /*!<@brief Pin name */
#define BOARD_TSI_ELECTRODE_1_LABEL "E1[1]/TSI_CH11/FXIO_D6" /*!<@brief Label */
#define BOARD_TSI_ELECTRODE_1_NAME "TSI_ELECTRODE_1"         /*!<@brief Identifier name */
                                                             /* @} */

