Masmiseim36/nxpSDK/boards/frdmkl81z/project_template/pin_mux.h
/*! @name PORTB19 (number 54), E2[1]/TSI_CH12/FXIO_D7
  @{ */
#define BOARD_TSI_ELECTRODE_2_PERIPHERAL TSI0                /*!<@brief Device name: TSI0 */
#define BOARD_TSI_ELECTRODE_2_SIGNAL CH                      /*!<@brief TSI0 signal: CH */
#define BOARD_TSI_ELECTRODE_2_PORT PORTB                     /*!<@brief PORT device name: PORTB */
#define BOARD_TSI_ELECTRODE_2_PIN 19U                        /*!<@brief PORTB pin index: 19 */
#define BOARD_TSI_ELECTRODE_2_CHANNEL 12                     /*!<@brief TSI0 channel: 12 */
#define BOARD_TSI_ELECTRODE_2_PIN_NAME TSI0_CH12             /*!<@brief Pin name */
#define BOARD_TSI_ELECTRODE_2_LABEL "E2[1]/TSI_CH12/FXIO_D7" /*!<@brief Label */
#define BOARD_TSI_ELECTRODE_2_NAME "TSI_ELECTRODE_2"         /*!<@brief Identifier name */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTSIPins(void);

/*! @name PORTE0 (number 1), U11[7]/QSPIA_DATA3
  @{ */
#define BOARD_QSPI0A_DATA3_PERIPHERAL QuadSPI0        /*!<@brief Device name: QuadSPI0 */
#define BOARD_QSPI0A_DATA3_SIGNAL DATA3               /*!<@brief QuadSPI0 signal: DATA3 */
#define BOARD_QSPI0A_DATA3_PORT PORTE                 /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0A_DATA3_PIN 0U                     /*!<@brief PORTE pin index: 0 */
#define BOARD_QSPI0A_DATA3_CHANNEL A                  /*!<@brief QuadSPI0 DATA3 channel: A */
#define BOARD_QSPI0A_DATA3_PIN_NAME QSPI0A_DATA3      /*!<@brief Pin name */
#define BOARD_QSPI0A_DATA3_LABEL "U11[7]/QSPIA_DATA3" /*!<@brief Label */
#define BOARD_QSPI0A_DATA3_NAME "QSPI0A_DATA3"        /*!<@brief Identifier name */
                                                      /* @} */

/*! @name PORTE1 (number 2), U11[6]/QSPIA_SCLK
  @{ */
#define BOARD_QSPI0A_SCLK_PERIPHERAL QuadSPI0       /*!<@brief Device name: QuadSPI0 */
#define BOARD_QSPI0A_SCLK_SIGNAL SCLK               /*!<@brief QuadSPI0 signal: SCLK */
#define BOARD_QSPI0A_SCLK_PORT PORTE                /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0A_SCLK_PIN 1U                    /*!<@brief PORTE pin index: 1 */
#define BOARD_QSPI0A_SCLK_CHANNEL A                 /*!<@brief QuadSPI0 SCLK channel: A */
#define BOARD_QSPI0A_SCLK_PIN_NAME QSPI0A_SCLK      /*!<@brief Pin name */
#define BOARD_QSPI0A_SCLK_LABEL "U11[6]/QSPIA_SCLK" /*!<@brief Label */
#define BOARD_QSPI0A_SCLK_NAME "QSPI0A_SCLK"        /*!<@brief Identifier name */
                                                    /* @} */

/*! @name PORTE2 (number 3), U11[5]/QSPIA_DATA0
  @{ */
#define BOARD_QSPI0A_DATA0_PERIPHERAL QuadSPI0        /*!<@brief Device name: QuadSPI0 */
#define BOARD_QSPI0A_DATA0_SIGNAL DATA0               /*!<@brief QuadSPI0 signal: DATA0 */
#define BOARD_QSPI0A_DATA0_PORT PORTE                 /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0A_DATA0_PIN 2U                     /*!<@brief PORTE pin index: 2 */
#define BOARD_QSPI0A_DATA0_CHANNEL A                  /*!<@brief QuadSPI0 DATA0 channel: A */
#define BOARD_QSPI0A_DATA0_PIN_NAME QSPI0A_DATA0      /*!<@brief Pin name */
#define BOARD_QSPI0A_DATA0_LABEL "U11[5]/QSPIA_DATA0" /*!<@brief Label */
#define BOARD_QSPI0A_DATA0_NAME "QSPI0A_DATA0"        /*!<@brief Identifier name */
                                                      /* @} */

/*! @name PORTE3 (number 4), U11[3]/QSPIA_DATA2
  @{ */
#define BOARD_QSPI0A_DATA2_PERIPHERAL QuadSPI0        /*!<@brief Device name: QuadSPI0 */
#define BOARD_QSPI0A_DATA2_SIGNAL DATA2               /*!<@brief QuadSPI0 signal: DATA2 */
#define BOARD_QSPI0A_DATA2_PORT PORTE                 /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0A_DATA2_PIN 3U                     /*!<@brief PORTE pin index: 3 */
#define BOARD_QSPI0A_DATA2_CHANNEL A                  /*!<@brief QuadSPI0 DATA2 channel: A */
#define BOARD_QSPI0A_DATA2_PIN_NAME QSPI0A_DATA2      /*!<@brief Pin name */
#define BOARD_QSPI0A_DATA2_LABEL "U11[3]/QSPIA_DATA2" /*!<@brief Label */
#define BOARD_QSPI0A_DATA2_NAME "QSPI0A_DATA2"        /*!<@brief Identifier name */
                                                      /* @} */

/*! @name PORTE4 (number 7), U11[2]/QSPIA_DATA1
  @{ */
#define BOARD_QSPI0A_DATA1_PERIPHERAL QuadSPI0        /*!<@brief Device name: QuadSPI0 */
#define BOARD_QSPI0A_DATA1_SIGNAL DATA1               /*!<@brief QuadSPI0 signal: DATA1 */
#define BOARD_QSPI0A_DATA1_PORT PORTE                 /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0A_DATA1_PIN 4U                     /*!<@brief PORTE pin index: 4 */
#define BOARD_QSPI0A_DATA1_CHANNEL A                  /*!<@brief QuadSPI0 DATA1 channel: A */
#define BOARD_QSPI0A_DATA1_PIN_NAME QSPI0A_DATA1      /*!<@brief Pin name */
#define BOARD_QSPI0A_DATA1_LABEL "U11[2]/QSPIA_DATA1" /*!<@brief Label */
#define BOARD_QSPI0A_DATA1_NAME "QSPI0A_DATA1"        /*!<@brief Identifier name */
                                                      /* @} */

/*! @name PORTE5 (number 8), U11[1]/QSPIA_SS
  @{ */
#define BOARD_QSPI0A_SS_PERIPHERAL QuadSPI0     /*!<@brief Device name: QuadSPI0 */
#define BOARD_QSPI0A_SS_SIGNAL SS0              /*!<@brief QuadSPI0 signal: SS0 */
#define BOARD_QSPI0A_SS_PORT PORTE              /*!<@brief PORT device name: PORTE */
#define BOARD_QSPI0A_SS_PIN 5U                  /*!<@brief PORTE pin index: 5 */
#define BOARD_QSPI0A_SS_CHANNEL A               /*!<@brief QuadSPI0 SS0 channel: A */
#define BOARD_QSPI0A_SS_PIN_NAME QSPI0A_SS0_B   /*!<@brief Pin name */
#define BOARD_QSPI0A_SS_LABEL "U11[1]/QSPIA_SS" /*!<@brief Label */
#define BOARD_QSPI0A_SS_NAME "QSPI0A_SS"        /*!<@brief Identifier name */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPIPins(void);

#define SOPT5_LPUART0RXSRC_LPUART_RX 0x00u /*!<@brief LPUART 0 receive data source select: LPUART0_RX pin */
#define SOPT5_LPUART0TXSRC_LPUART_TX 0x00u /*!<@brief LPUART0 transmit data source select: LPUART0_TX pin */

