Masmiseim36/nxpSDK/boards/frdmkl81z/project_template/pin_mux.h
/*! @name PORTA1 (number 30), J24[3]/J1[11]/BLUETOOTH_UART1_RX/Arduino_SOF_OUT
  @{ */
/*!
 * @brief Device name: LPUART0 */
#define BOARD_BLUETOOTH_UART0_RX_PERIPHERAL LPUART0
/*!
 * @brief LPUART0 signal: RX */
#define BOARD_BLUETOOTH_UART0_RX_SIGNAL RX
/*!
 * @brief PORT device name: PORTA */
#define BOARD_BLUETOOTH_UART0_RX_PORT PORTA
/*!
 * @brief PORTA pin index: 1 */
#define BOARD_BLUETOOTH_UART0_RX_PIN 1U
/*!
 * @brief Pin name */
#define BOARD_BLUETOOTH_UART0_RX_PIN_NAME LPUART0_RX
/*!
 * @brief Label */
#define BOARD_BLUETOOTH_UART0_RX_LABEL "J24[3]/J1[11]/BLUETOOTH_UART1_RX/Arduino_SOF_OUT"
/*!
 * @brief Identifier name */
#define BOARD_BLUETOOTH_UART0_RX_NAME "BLUETOOTH_UART0_RX"
/* @} */

/*! @name PORTA2 (number 31), J1[13]/J24[4]/Arduino_I2S_RX_FS/BLUETOOTH_UART1_TX
  @{ */
/*!
 * @brief Device name: LPUART0 */
#define BOARD_BLUETOOTH_UART0_TX_PERIPHERAL LPUART0
/*!
 * @brief LPUART0 signal: TX */
#define BOARD_BLUETOOTH_UART0_TX_SIGNAL TX
/*!
 * @brief PORT device name: PORTA */
#define BOARD_BLUETOOTH_UART0_TX_PORT PORTA
/*!
 * @brief PORTA pin index: 2 */
#define BOARD_BLUETOOTH_UART0_TX_PIN 2U
/*!
 * @brief Pin name */
#define BOARD_BLUETOOTH_UART0_TX_PIN_NAME LPUART0_TX
/*!
 * @brief Label */
#define BOARD_BLUETOOTH_UART0_TX_LABEL "J1[13]/J24[4]/Arduino_I2S_RX_FS/BLUETOOTH_UART1_TX"
/*!
 * @brief Identifier name */
#define BOARD_BLUETOOTH_UART0_TX_NAME "BLUETOOTH_UART0_TX"
/*!
 * @brief Direction */
#define BOARD_BLUETOOTH_UART0_TX_DIRECTION kPIN_MUX_DirectionOutput
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBLUETOOTHPins(void);

/*! @name PORTD2 (number 75), J12[3]/U6[4]/Camera_I2C_SCL/I2C_SCL_FXOS8700CQ
  @{ */
/*!
 * @brief Device name: I2C0 */
#define BOARD_ACCEL_I2C_SCL_PERIPHERAL I2C0
/*!
 * @brief I2C0 signal: SCL */
#define BOARD_ACCEL_I2C_SCL_SIGNAL SCL
/*!
 * @brief PORT device name: PORTD */
#define BOARD_ACCEL_I2C_SCL_PORT PORTD
/*!
 * @brief PORTD pin index: 2 */
#define BOARD_ACCEL_I2C_SCL_PIN 2U
/*!
 * @brief Pin name */
#define BOARD_ACCEL_I2C_SCL_PIN_NAME I2C0_SCL
/*!
 * @brief Label */
#define BOARD_ACCEL_I2C_SCL_LABEL "J12[3]/U6[4]/Camera_I2C_SCL/I2C_SCL_FXOS8700CQ"
/*!
 * @brief Identifier name */
#define BOARD_ACCEL_I2C_SCL_NAME "ACCEL_I2C_SCL"
/* @} */

/*! @name PORTD3 (number 76), J12[4]/U6[6]/I2C0_SDA/Camera_I2C_SDA/I2C_SDA_FXOS8700CQ
  @{ */
/*!
 * @brief Device name: I2C0 */
#define BOARD_ACCEL_I2C_SDA_PERIPHERAL I2C0
/*!
 * @brief I2C0 signal: SDA */
#define BOARD_ACCEL_I2C_SDA_SIGNAL SDA
/*!
 * @brief PORT device name: PORTD */
#define BOARD_ACCEL_I2C_SDA_PORT PORTD
/*!
 * @brief PORTD pin index: 3 */
#define BOARD_ACCEL_I2C_SDA_PIN 3U
/*!
 * @brief Pin name */
#define BOARD_ACCEL_I2C_SDA_PIN_NAME I2C0_SDA
/*!
 * @brief Label */
#define BOARD_ACCEL_I2C_SDA_LABEL "J12[4]/U6[6]/I2C0_SDA/Camera_I2C_SDA/I2C_SDA_FXOS8700CQ"
/*!
 * @brief Identifier name */
#define BOARD_ACCEL_I2C_SDA_NAME "ACCEL_I2C_SDA"
/* @} */

/*! @name PORTC13 (number 70), U6[11]/INT1_FXOS8700CQ_R/ACCEL_INT1
  @{ */
#define BOARD_ACCEL_INT1_PERIPHERAL GPIOC                            /*!<@brief Device name: GPIOC */
#define BOARD_ACCEL_INT1_SIGNAL GPIO                                 /*!<@brief GPIOC signal: GPIO */
#define BOARD_ACCEL_INT1_GPIO GPIOC                                  /*!<@brief GPIO device name: GPIOC */
#define BOARD_ACCEL_INT1_GPIO_PIN 13U                                /*!<@brief PORTC pin index: 13 */
#define BOARD_ACCEL_INT1_PORT PORTC                                  /*!<@brief PORT device name: PORTC */
#define BOARD_ACCEL_INT1_PIN 13U                                     /*!<@brief PORTC pin index: 13 */
#define BOARD_ACCEL_INT1_CHANNEL 13                                  /*!<@brief GPIOC GPIO channel: 13 */
#define BOARD_ACCEL_INT1_PIN_NAME PTC13                              /*!<@brief Pin name */
#define BOARD_ACCEL_INT1_LABEL "U6[11]/INT1_FXOS8700CQ_R/ACCEL_INT1" /*!<@brief Label */
#define BOARD_ACCEL_INT1_NAME "ACCEL_INT1"                           /*!<@brief Identifier name */
#define BOARD_ACCEL_INT1_DIRECTION kPIN_MUX_DirectionInput           /*!<@brief Direction */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
